#include <stdio.h>

float formula(int fahrenheit) {
    return 5.0 / 9.0 * (fahrenheit - 32);
}

int main() {
    //Напиши програм кој конвертира целобројни фарантхајтови температури од 0-212 степени во децимални цезлиусови температури со 3 цифри прецизност.
    // Да се користи формулата:
    //celsius = 5.0 /9.0 * (fahrenheit - 32).
    //Излезот да се испечати во две десно порамнети колони од по 10 карактери, а целзиусовите вредности треба да се предводени од знак и за позитивни и за негативни вредности.
    float celsius;
    for(int faran=0;faran<=212;faran++) {
        celsius = formula(faran);
        printf("%10d %+.3f\n",faran, celsius);
    }

    return 0;
}
