#include <stdio.h>

void prosti(int niza[], int n) {
    for (int i = 2; i < n; i++) {
        if (niza[i] == 1) {
            for (int j = i * i; j < n; j += i) {
                niza[j] = 0;
            }
        }
    }
}

void pecatiProsti(int niza[], int n) {
    for (int i = 2; i < n; i++) {
        if (niza[i] == 1)
            printf("%d ", i);
    }
}

int main() {
    //	Прости броеви се броеви кои се деливи само со себе си и со бројот 1.
    //	Напиши програм кој внесува n елементи во низа. Да се овозможи функционалност да имаме променлив број на елементи во низата.
    //	Во почетокот сите елементи да се иницијализираат на 1. Потоа да се напише функција prosti која секој елемент од низата чиј индекс е прост број, го поставува на 0.
    //	На крај од така добиената низа да се најде начин да се испечатат простите броеви до n.
    int n;
    scanf("%d",&n);
    int niza[n];
    for (int i = 0; i < n; i++) {
        niza[i] = 1;
    }
    prosti(niza, n);
    pecatiProsti(niza, n);

    return 0;
}
